Namespace:   Autodesk.Revit.UI.Macros
  Assembly:   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public override void CreateRibbonTab(
	string tabName
)
  Visual Basic
Public Overrides Sub CreateRibbonTab ( _
	tabName As String _
)
  Visual C++
public:
virtual void CreateRibbonTab(
	String^ tabName
) override
 Parameters
  tabName
 Type:  System String
 See Also
  ApplicationEntryPoint Class
  Autodesk.Revit.UI.Macros Namespace